app/controllers/pins_controller.rb

	def create
		@pin = Pin.new(pin_params)

		if @pin.save
---
INSERT INTO "pins" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)

	def update
		if @pin.update(pin_params)
---
UPDATE "pins" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?